#pragma once

/*based on libjpeg*/


#include <vector>
#define JPEG_QUALITY 50     //它的大小决定jpg的质量好坏
extern "C" {
#include "../jpeg/jpeglib.h"
#include <hd_plat_base.h>
}


using namespace std;

typedef struct _Ring {
	int nRef; //反射值
	double dAngle; //点的角度方向
}Ring;

typedef vector<Ring> VecRing;
typedef vector<VecRing> VecRings;
typedef vector<int> VecPixelCol;
typedef vector<VecPixelCol> VecPixelCols;

/*! @class
 ********************************************************************************
 <PRE>
 类名称   : hdjpg
 功能     : 生成灰度图
 异常类   :
 --------------------------------------------------------------------------------
 备注     :
 典型用法 :
 --------------------------------------------------------------------------------
 作者     : 陈号  宋志军
 </PRE>
 *******************************************************************************/
class hdjpg {
public:
	hdjpg(void);
	~hdjpg(void);
	/********************************************************************************************************/
	/* 设置扫描区域                                                                                             */
	/********************************************************************************************************/
	void SetScanArea(double dHStart, double dHEnd, double dVStart,
			double dVEnd);

	/********************************************************************************************************/
	/* 得到当前水平扫描角度                                                                                     */
	/********************************************************************************************************/
	double GetCurrentHAngle();

	/********************************************************************************************************/
	/* 根据扫描一圈的数据填充的灰度图缓存                                                                        */
	/********************************************************************************************************/
	void FillBuffer(VecRing vecEchos);

	/********************************************************************************************************/
	/* 由左右buffer得到实际需要转换为jpg的buffer缓存                                                             */
	/********************************************************************************************************/
	unsigned char * GetUnionBuffer();

	/********************************************************************************************************/
	/* 计算左边和右边是否需要填充                                                                                */
	/********************************************************************************************************/
	void CaclSides();

	/********************************************************************************************************/
	/* 根据扫描数据灰度值缓存生成对应的灰度图                                                                    */
	/********************************************************************************************************/
	int SaveImage(char *filename, unsigned char *bits, int width, int height,
			int depth);

	/********************************************************************************************************/
	/* 设置参数                                                                                                  */
	/********************************************************************************************************/
	void SetParam(double dHStart, double dHEnd, double dVStart, double dVEnd,
			double dResolution);

	/********************************************************************************************************/
	/* 重采样                                                                                                */
	/********************************************************************************************************/
	void ResampleBuffer(unsigned char* pBuffer, unsigned int nRows,
			unsigned int nCols, unsigned int nPixelSize,
			unsigned char* pDestBuffer, unsigned int nDestRows,
			unsigned int nDestCols);

	/********************************************************************************************************/
	/* 清空内存                                                                                               */
	/********************************************************************************************************/
	void Clear();

	/********************************************************************************************************/
	/* 生成灰度图                                                                                               */
	/********************************************************************************************************/
	void GeneraPic();

	/********************************************************************************************************/
	/* 设置存储路径                                                                                              */
	/********************************************************************************************************/
	void SetPicDir(char* szPicDir);
public:
	VecPixelCols m_vecLeftImage; //左边缓存
	VecPixelCols m_vecRightImage; //右边缓存
	int nRealCol; //列数
	int nRealRow; //行数
	double m_dHStartAngle; //水平起始角度
	double m_dHEndAngle; //水平终止角度
	double m_dVStartAngle; //垂直起始角度
	double m_dVEndAngle; //垂直终止角度
	double m_dCurrentAngle; //当前水平角度
	double m_iPoints; //当前垂直点数

	static const int m_iMinRGB = 1; // RGB最小值（由1改为130，以增加亮度（20120809））
	static const int m_iMaxRGB = 255; // RGB最大值
	static const int m_nEchoSpan = 630; // 最小最大echo跨度

	bool m_bLeftFill; //左边是否需要填充
	bool m_bRightFill; // 右边是否需要填充

	char* m_szPicDir; //图片存储路径
};

